W6D3/Stephen_VP_first_routes_and_controllers/app/controllers/users_controller.rb

    def create
        @user = User.new(user_params)
        if @user.save!
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Steve"], ["email", "stv@agg.com"], ["created_at", "2022-01-10 15:58:05.191811"], ["updated_at", "2022-01-10 15:58:05.191811"]]