W7D2/stvp_99_cats/app/models/cat_rental_request.rb

SELECT "cat_rental_requests".* FROM "cat_rental_requests" WHERE (cat_rental_requests.end_date BETWEEN '2020-01-01' AND '2020-01-02' OR cat_rental_requests.start_date BETWEEN '2020-01-01' AND '2020-01-02') AND "cat_rental_requests"."status" = $1 AND "cat_rental_requests"."id" != $2  [["status", "PENDING"], ["id", 1]]
---
    def overlapping_pending_requests
        self.overlapping_requests.where(status:'PENDING').where.not(id:self.id)

UPDATE "cat_rental_requests" SET "status" = $1, "updated_at" = $2 WHERE "cat_rental_requests"."id" = $3  [["status", "APPROVED"], ["updated_at", "2022-01-19 18:04:28.604490"], ["id", 1]]
---
    def approve!
        CatRentalRequest.transaction do
            self.status = "APPROVED"
            self.save

UPDATE "cat_rental_requests" SET "status" = $1, "updated_at" = $2 WHERE "cat_rental_requests"."id" = $3  [["status", "DENIED"], ["updated_at", "2022-01-19 18:04:24.860384"], ["id", 1]]
---
    def deny!
        self.status = "DENIED"
        self.save