W7D5/stvp_music_app/app/views/bands/show.html.erb

<div class="showing-main">
<% @band.albums.each do |album| %>
---
SELECT "albums".* FROM "albums" WHERE "albums"."band_id" = $1  [["band_id", 10]]