W7D1/Stephen_VP_art_shared_api part2/app/controllers/artworks_controller.rb

  def index
    if params[:user_id]
      if params[:section] == "owned"
        @arts = User.find(params[:user_id]).artworks
      elsif
        @arts = User.find(params[:user_id]).shared_artworks
      end
    else
      @arts = Artwork.all
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 33], ["LIMIT", 1]]
SELECT "artworks".* FROM "artworks"

  def create
    @artwork = Artwork.new(artwork_params)
    if @artwork.save
---
INSERT INTO "artworks" ("title", "image_url", "artist_id", "created_at", "updated_at", "favorite") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Storm"], ["image_url", "storm.hd"], ["artist_id", 39], ["created_at", "2022-01-17 03:20:52.130362"], ["updated_at", "2022-01-17 03:20:52.130362"], ["favorite", true]]