W7D1/Stephen_VP_art_shared_api part2/app/controllers/artwork_shares_controller.rb

INSERT INTO "artwork_shares" ("viewer_id", "artwork_id", "created_at", "updated_at", "favorite") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["viewer_id", 39], ["artwork_id", 11], ["created_at", "2022-01-17 03:23:40.350472"], ["updated_at", "2022-01-17 03:23:40.350472"], ["favorite", true]]
---
    def create
        @artwork_share = ArtworkShare.new(artwork_share_params)
       if @artwork_share.save

SELECT "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "artwork_shares" WHERE "artwork_shares"."id" = $1  [["id", 1]]
---
    def destroy
        @artwork_share = ArtworkShare.find(params[:id])
        if @artwork_share.destroy