W7D1/Stephen_VP_art_shared_api part2/app/controllers/collections_controller.rb

    def index
        if params[:search]
            search_value = '%'+ params[:search] +'%'
            @collections = Collection.where(user_id:params[:user_id])
            @collections = @collections.where("LOWER(collections.title) LIKE LOWER(?)",search_value)
        else
            @collections = Collection.where(user_id:params[:user_id])
---
SELECT "collections".* FROM "collections" WHERE "collections"."user_id" = $1  [["user_id", 33]]
SELECT "collections".* FROM "collections" WHERE "collections"."user_id" = $1 AND (LOWER(collections.title) LIKE LOWER('%"modern"%'))  [["user_id", 33]]

    def create
        @collection = Collection.new(collection_params)
        if @collection.save
---
INSERT INTO "collections" ("title", "user_id", "artwork_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Western Art"], ["user_id", 33], ["artwork_id", 11], ["created_at", "2022-01-17 05:32:11.532674"], ["updated_at", "2022-01-17 05:32:11.532674"]]