W7D1/Stephen_VP_art_shared_api part2/app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = $1  [["user_id", 33]]
SELECT "comments".* FROM "comments" WHERE "comments"."artwork_id" = $1  [["artwork_id", 10]]
---
    def index
        if params[:user_id]
            @comments = Comment.where(user_id:params[:user_id])
        elsif params[:artwork_id]
            @comments = Comment.where(artwork_id:params[:artwork_id])
        else
            @comments = Comment.all

INSERT INTO "comments" ("body", "user_id", "artwork_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "i love this piece of art"], ["user_id", 33], ["artwork_id", 11], ["created_at", "2022-01-16 15:12:38.875524"], ["updated_at", "2022-01-16 15:12:38.875524"]]
---
    def create
        @comment = Comment.new(comment_params)
        if @comment.save