W7D1/Stephen_VP_art_shared_api part2/app/controllers/likes_controller.rb

    def index
       if params[:user_id]
           @likes = Like.where(user_id:params[:user_id])
       elsif params[:artwork_id]
           @likes = Like.where(likable_type:'Artwork',likable_id:params[:artwork_id])
       elsif params[:comment_id]
            @likes = Like.where(likable_type:'Comment',likable_id:params[:comment_id])
---
SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = $1  [["user_id", 33]]
SELECT "likes".* FROM "likes" WHERE "likes"."likable_type" = $1 AND "likes"."likable_id" = $2  [["likable_type", "Comment"], ["likable_id", 4]]

    def create
       @like = Like.new(like_params)
        if @like.save
---
INSERT INTO "likes" ("likable_type", "likable_id", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["likable_type", "Comment"], ["likable_id", 5], ["created_at", "2022-01-17 02:43:50.948411"], ["updated_at", "2022-01-17 02:43:50.948411"], ["user_id", 37]]