W7D1/Stephen_VP_art_shared_api part2/app/controllers/users_controller.rb

    def index
        if params[:search]
        search_pattern = "%" + params[:search] +"%"
        @users = User.where("LOWER(users.username) LIKE LOWER(?)",search_pattern)
        else
        @users = User.all
---
SELECT "users".* FROM "users" WHERE (LOWER(users.username) LIKE LOWER('%s%'))

    def create
        @user = User.new(self.user_params)
        if @user.save
---
INSERT INTO "users" ("username", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["username", "John"], ["created_at", "2022-01-16 15:27:34.104801"], ["updated_at", "2022-01-16 15:27:34.104801"]]