W8D5/stvp_reddit_clone/app/models/post.rb

    def vote_of_comment_by_post

        #the join method
        result = Hash.new{|h,k| h[k] = 0}
        @ordered_comments = self.comments
        .left_outer_joins(:votes)
        .select("comments.*,COALESCE(SUM(votes.value),0) AS num")
        .group("comments.id").order("num DESC")

        @ordered_comments.each do |comment|
---
SELECT comments.*,COALESCE(SUM(votes.value),0) AS num FROM "comments" LEFT OUTER JOIN "votes" ON "votes"."votable_type" = $1 AND "votes"."votable_id" = "comments"."id" WHERE "comments"."post_id" = $2 GROUP BY "comments"."id" ORDER BY num DESC  [["votable_type", "Comment"], ["post_id", 1]]
SELECT comments.*,COALESCE(SUM(votes.value),0) AS num FROM "comments" LEFT OUTER JOIN "votes" ON "votes"."votable_type" = $1 AND "votes"."votable_id" = "comments"."id" WHERE "comments"."post_id" = $2 GROUP BY "comments"."id" ORDER BY num DESC  [["votable_type", "Comment"], ["post_id", 4]]