W8D5/stvp_reddit_clone/app/models/sub.rb

SELECT posts.*,COALESCE(SUM(votes.value),0) AS num FROM "posts" INNER JOIN "post_subs" ON "posts"."id" = "post_subs"."post_id" LEFT OUTER JOIN "votes" ON "votes"."votable_type" = $1 AND "votes"."votable_id" = "posts"."id" WHERE "post_subs"."sub_id" = $2 GROUP BY "posts"."id" ORDER BY num DESC  [["votable_type", "Post"], ["sub_id", 1]]
---
    def vote_of_post_by_sub
        result = Hash.new{|h,k| h[k] = 0}

        #using join method
        ordered_posts = self.posts.left_outer_joins(:votes)
        .select("posts.*,COALESCE(SUM(votes.value),0) AS num")
        .group("posts.id").order("num DESC")

        ordered_posts.each do |post|