W8D5/stvp_reddit_clone/app/models/user.rb

SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "a"], ["LIMIT", 1]]
---
    def self.login_by_credentials(usr,pass)
        user = User.find_by(username:usr)

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "jl9OK7QoOOUqCw"], ["updated_at", "2022-02-17 06:06:29.770210"], ["id", 1]]
---
    def reset_session_token
        self.session_token = User.generate_session_token
        self.save!

INSERT INTO "votes" ("user_id", "value", "votable_type", "votable_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 4], ["value", 1], ["votable_type", "Post"], ["votable_id", 2], ["created_at", "2022-02-18 15:47:33.291055"], ["updated_at", "2022-02-18 15:47:33.291055"]]
UPDATE "votes" SET "value" = $1, "updated_at" = $2 WHERE "votes"."id" = $3  [["value", 0], ["updated_at", "2022-02-18 15:57:14.522496"], ["id", 7]]
---
     def upvote(target) #target is a post or a comment
        vote = Vote.find_by(user_id:self.id,votable:target)
        if vote.nil?
            Vote.create!(user_id:self.id,value:1,votable:target)
        else
           if vote.value < 1
             vote.value +=1
             vote.save

INSERT INTO "votes" ("user_id", "value", "votable_type", "votable_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 2], ["value", -1], ["votable_type", "Comment"], ["votable_id", 59], ["created_at", "2022-02-19 03:51:00.115474"], ["updated_at", "2022-02-19 03:51:00.115474"]]
UPDATE "votes" SET "value" = $1, "updated_at" = $2 WHERE "votes"."id" = $3  [["value", -1], ["updated_at", "2022-02-19 03:41:56.312726"], ["id", 6]]
---
    def downvote(target)
        vote = Vote.find_by(user_id:self.id,votable:target)
        if vote.nil?
            Vote.create!(user_id:self.id,value:-1,votable:target)
        else
            if vote.value > -1
            vote.value -=1
            vote.save