W7D5/stvp_music_app/app/controllers/albums_controller.rb

SELECT "bands".* FROM "bands"
SELECT "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
---
    def new
        @bands = Band.all
        @current_band = Band.find_by(id:params[:band_id])

SELECT "bands".* FROM "bands"
SELECT "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
INSERT INTO "albums" ("band_id", "title", "year", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["band_id", 14], ["title", "my"], ["year", 1001], ["created_at", "2022-01-26 01:13:51.962487"], ["updated_at", "2022-01-26 01:13:51.962487"]]
---
    def create
        @bands = Band.all
        @album = Album.new(album_params)
        @current_band = Band.find_by(id:album_params[:band_id])
        if @album.save