W7D5/stvp_music_app/app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "xut_ky55KuvZoMvoHMgAUQ"], ["LIMIT", 1]]
---
    def current_user

        return nil if session[:session_token].nil?
        User.find_by(session_token:session[:session_token])