W7D5/stvp_music_app/app/controllers/bands_controller.rb

    def destroy
        @band = Band.find_by(id:params[:id])
        if @band.destroy
---
SELECT "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
DELETE FROM "bands" WHERE "bands"."id" = $1  [["id", 11]]