W7D5/stvp_music_app/app/controllers/notes_controller.rb

SELECT "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]
INSERT INTO "notes" ("user_id", "track_id", "note", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 7], ["track_id", 9], ["note", "hey"], ["created_at", "2022-01-25 11:52:29.313226"], ["updated_at", "2022-01-25 11:52:29.313226"]]
---
def create
    @track = Track.find_by(id:params[:track_id])
    @note = Note.new(note_params)
    @note.user_id = current_user.id
    @note.track_id = params[:track_id]
    if @note.save

SELECT "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
---
def show
    @track = Track.find_by(id:params[:track_id])

SELECT "notes".* FROM "notes" WHERE "notes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "notes" WHERE "notes"."id" = $1  [["id", 1]]
---
def destroy
    @note = Note.find_by(id:params[:id])
    @track = @note.track
    if @note.destroy