W7D5/stvp_music_app/app/controllers/sessions_controller.rb

UPDATE "users" SET "updated_at" = $1, "activated" = $2 WHERE "users"."id" = $3  [["updated_at", "2022-01-26 05:29:52.900682"], ["activated", true], ["id", 26]]
---
    def create
        @activation_token = params[:activation_token]
        @user_details = User.new(user_params)
        @user = User.find_by_credentials(params[:user][:username],params[:user][:password])
        if @user.nil?
            flash[:error] = ["Wrong credentails"]
            render :new
        elsif !@user.activated?
            if @user.activation_token == @activation_token
                @user.update(activated:true)