W7D5/stvp_music_app/app/controllers/tracks_controller.rb

SELECT "albums".* FROM "albums"
SELECT "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
---
    def new
        @albums = Album.all
        @current_album = Album.find_by(id:params[:album_id])

SELECT "albums".* FROM "albums"
SELECT "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
INSERT INTO "tracks" ("album_id", "title", "lyric", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["album_id", 10], ["title", "kinf"], ["lyric", "dsdsd"], ["created_at", "2022-01-25 18:56:04.979838"], ["updated_at", "2022-01-25 18:56:04.979838"]]
---
    def create
        @albums = Album.all
        @current_album = Album.find_by(id:track_params[:album_id])
        @track = Track.new(track_params)
        if @track.save

SELECT "albums".* FROM "albums"
SELECT "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def edit
        @albums = Album.all
        @track = Track.find_by(id:params[:id])

SELECT "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "tracks" SET "lyric" = $1, "regular" = $2, "updated_at" = $3 WHERE "tracks"."id" = $4  [["lyric", "ha ha hah a aashds hsd\r\n"], ["regular", false], ["updated_at", "2022-01-25 10:18:15.473890"], ["id", 1]]
---
    def update
        @track = Track.find_by(id:params[:id])
        @albums = Album.all
        @current_album = @track.album
        if @track.update(track_params)

SELECT "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 18], ["LIMIT", 1]]
DELETE FROM "tracks" WHERE "tracks"."id" = $1  [["id", 18]]
---
    def destroy
        @track = Track.find_by(id:params[:id])
        @album = @track.album
        if @track.destroy