W7D5/stvp_music_app/app/controllers/users_controller.rb

    def activate
        if current_user.nil?
            redirect_to "/session/new?activation_token=#{params[:activation_token]}"
        elsif current_user.activated?
            flash[:notice] = 'You have already active your account'
             redirect_to "/bands"
        elsif current_user.activation_token == params[:activation_token]
            current_user.update(activated:true)
---
UPDATE "users" SET "updated_at" = $1, "activated" = $2 WHERE "users"."id" = $3  [["updated_at", "2022-01-26 07:26:38.214025"], ["activated", true], ["id", 30]]

    def create
        @user = User.new(user_params)
       if @user.save
---
INSERT INTO "users" ("username", "password_digest", "session_token", "created_at", "updated_at", "activation_token") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"