W11D6/stvp_todo_p3/app/models/todo.rb

    def tag_names=(tag_names)
        self.tags = tag_names.map do |tag_name|
        Tag.find_or_create_by(name: tag_name)
---
SELECT "tags".* FROM "tags" WHERE "tags"."name" = $1 LIMIT $2  [["name", "house"], ["LIMIT", 1]]
INSERT INTO "tags" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "band"], ["created_at", "2022-05-04 12:15:24.869284"], ["updated_at", "2022-05-04 12:15:24.869284"]]
SELECT "tags".* FROM "tags" WHERE "tags"."name" = $1 LIMIT $2  [["name", "love"], ["LIMIT", 1]]