W11D6/stvp_todo_p3/app/models/user.rb

    def self.login_by_credential(usr,pass)
        user = User.find_by(username:usr)
---
SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "steve1"], ["LIMIT", 1]]