W11D6/stvp_todo_p3/app/controllers/api/steps_controller.rb

    def index
        @steps = Step.all
---
SELECT "steps".* FROM "steps"

    def create
        @step = Step.new(step_params)
        if @step.save
---
INSERT INTO "steps" ("title", "description", "todo_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "love"], ["description", "like"], ["todo_id", 34], ["created_at", "2022-05-04 12:45:06.226332"], ["updated_at", "2022-05-04 12:45:06.226332"]]

    def update
        @step = Step.find_by(id:params[:id])
        if @step.update(step_params)
---
SELECT "steps".* FROM "steps" WHERE "steps"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]
UPDATE "steps" SET "done" = $1, "updated_at" = $2 WHERE "steps"."id" = $3  [["done", true], ["updated_at", "2022-05-04 15:34:57.138918"], ["id", 17]]

    def destroy
        @step = Step.find_by(id:params[:id])
        if @step.destroy
---
SELECT "steps".* FROM "steps" WHERE "steps"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
DELETE FROM "steps" WHERE "steps"."id" = $1  [["id", 16]]