W11D6/stvp_todo_p3/app/controllers/api/todos_controller.rb

INSERT INTO "todos" ("title", "body", "created_at", "updated_at", "author_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "stephen"], ["body", "love"], ["created_at", "2022-05-04 12:11:10.892018"], ["updated_at", "2022-05-04 12:11:10.892018"], ["author_id", 6]]
---
    def create
      @todo = current_user.todos.new(todo_params)
      if @todo.save

SELECT "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
UPDATE "todos" SET "done" = $1, "updated_at" = $2 WHERE "todos"."id" = $3  [["done", true], ["updated_at", "2022-05-04 15:29:29.983836"], ["id", 35]]
---
    def update
        @todo = current_user.todos.find_by(id:params[:id])
        if @todo.update(todo_params)

SELECT "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
DELETE FROM "todos" WHERE "todos"."id" = $1  [["id", 32]]
---
    def destroy
        @todo = current_user.todos.find_by(id:params[:id])
        if @todo.destroy