W8D5/stvp_reddit_clone/app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "eWAfef1ZBz9pTQ"], ["LIMIT", 1]]
---
    def current_user
        return nil if session[:session_token].nil?
        User.find_by(session_token:session[:session_token])