W8D5/stvp_reddit_clone/app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        @parent_comment = Comment.find_by(id:params[:id])

INSERT INTO "comments" ("content", "user_id", "post_id", "parent_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["content", "good thouth"], ["user_id", 5], ["post_id", 4], ["parent_id", 48], ["created_at", "2022-02-18 16:00:21.781580"], ["updated_at", "2022-02-18 16:00:21.781580"]]
---
    def create
        @comment = Comment.new(comment_params)
        @post = @comment.post
        @comment.author = current_user

        if @comment.save

SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 24], ["LIMIT", 1]]
---
    def upvote
        @comment = Comment.find_by(id:params[:id])

SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 24], ["LIMIT", 1]]
---
    def downvote
        @comment = Comment.find_by(id:params[:id])