W8D5/stvp_reddit_clone/app/controllers/posts_controller.rb

    def show
        @post = Post.find_by(id:params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def new
        @post = Post.new
        @subs = Sub.all
---
SELECT "subs".* FROM "subs"

    def create
        @post = Post.new(post_params)
        @post.author = current_user
       if @post.save
---
INSERT INTO "posts" ("title", "content", "url", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "News from Vietnamese"], ["content", "Russia war"], ["url", "reddit.xyz"], ["user_id", 5], ["created_at", "2022-02-19 03:49:08.227542"], ["updated_at", "2022-02-19 03:49:08.227542"]]

    def edit
        @post = Post.find_by(id:params[:id])
        @subs = Sub.all
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT "subs".* FROM "subs"

    def update

        @post = Post.find_by(id:params[:id])
        if @post.update(post_params)
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "content" = $1, "url" = $2, "updated_at" = $3 WHERE "posts"."id" = $4  [["content", "added content from steeve"], ["url", "new.com.vn"], ["updated_at", "2022-02-17 10:43:30.275562"], ["id", 1]]

    def upvote
        @post = Post.find_by(id:params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

    def downvote
        @post = Post.find_by(id:params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]