W8D5/stvp_reddit_clone/app/controllers/subs_controller.rb

SELECT "subs".* FROM "subs"
---
    def index
        @subs = Sub.all

SELECT "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        @sub = Sub.find_by(id:params[:id])

INSERT INTO "subs" ("title", "user_id", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "hey"], ["user_id", 3], ["description", "this is bad"], ["created_at", "2022-02-17 05:40:27.631051"], ["updated_at", "2022-02-17 05:40:27.631051"]]
---
    def create
        @sub = Sub.new(sub_params)
        @sub.moderator = current_user
       if @sub.save