W5D3/SVP_URLShortener/app/models/user.rb

INSERT INTO "shortened_urls" ("long_url", "short_url", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
    def shorten(l_url)

          ShortenedUrl.create!(
            long_url: l_url,
            user_id: self.id,
            short_url: ShortenedUrl.random_code(self.premium)
        )