W8D5/stvp_reddit_clone/app/views/posts/_form.html.erb

    <% subs.each do |sub| %>
        <input type="checkbox" name="post[sub_ids][]" id="<%= sub.id %>" value="<%= sub.id %>" <%= post.sub_ids.include?(sub.id) ? "checked" : "" %>>
---
SELECT "subs"."id" FROM "subs" INNER JOIN "post_subs" ON "subs"."id" = "post_subs"."sub_id" WHERE "post_subs"."post_id" = $1  [["post_id", 1]]