W7D2/stvp_99_cats/app/controllers/cat_rental_requests_controller.rb

SELECT "cat_rental_requests".* FROM "cat_rental_requests" ORDER BY "cat_rental_requests"."start_date" DESC
---
    def index
        @rentals = CatRentalRequest.all.order(start_date: :desc)

SELECT "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def new
        if params[:cat_id]
            @cats = Cat.where(id:params[:cat_id])
            @rental = CatRentalRequest.new
            render :new

        else
            @cats = Cat.all

SELECT "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "cat_rental_requests" ("cat_id", "start_date", "end_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["cat_id", 1], ["start_date", "1999-01-01"], ["end_date", "1999-01-02"], ["created_at", "2022-01-19 18:58:48.243685"], ["updated_at", "2022-01-19 18:58:48.243685"]]
---
    def create
        if params[:cat_id]
            @cats = Cat.where(id:params[:cat_id])
            @rental = CatRentalRequest.new(rental_params)
        else
            @rental = CatRentalRequest.new(rental_params)
            @cats = Cat.all
        end

        if @rental.save

SELECT "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
---
    def approve
        @rental = CatRentalRequest.find(params[:id])

SELECT "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def deny
        @rental = CatRentalRequest.find(params[:id])