W7D2/stvp_99_cats/app/controllers/cats_controller.rb

    def show
        @cat = Cat.find(params[:id])
        @rentals = @cat.cat_rental_requests.order(start_date: :desc)
---
SELECT "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."cat_id" = $1 ORDER BY "cat_rental_requests"."start_date" DESC  [["cat_id", 1]]

    def create
        @cat =  Cat.new(cat_params)
      if @cat.save
---
INSERT INTO "cats" ("name", "sex", "birth_date", "color", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

    def update
         @cat = Cat.find(params[:id])
        if @cat.update(cat_params)
---
SELECT "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "cats" SET "birth_date" = $1, "description" = $2, "updated_at" = $3 WHERE "cats"."id" = $4  [["birth_date", "1001-12-11"], ["description", "                    \r\nThis cat is older than dinosaur \r\n\r\n\r\n"], ["updated_at", "2022-01-20 05:26:28.333377"], ["id", 1]]