W7D5/stvp_music_app/app/models/user.rb

SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "user1"], ["LIMIT", 1]]
---
    def self.find_by_credentials(usrn,pass)
        user = User.find_by(username:usrn)